Repository: taresky/halffull
Catalog: Localizable.xcstrings
Source language: en
Languages: zh_hans

# about.tagline
source: A tiny menu-bar utility for switching text between half-width and full-width forms.
zh_hans: 一个小巧的菜单栏工具，用于在半角与全角文本之间快速切换。

# about.version
source: Version %@ (%@)
zh_hans: 版本 %@（%@）

# direction.smart
source: Smart (auto)
zh_hans: 智能（自动判断）

# direction.toFullWidth
source: Half → Full-width
zh_hans: 半角 → 全角

# direction.toHalfWidth
source: Full → Half-width
zh_hans: 全角 → 半角

# hotkey.recordButton
source: Record
zh_hans: 录制

# hotkey.conflict
source: That shortcut is already used by the other target.
zh_hans: 这个快捷键已被另一个目标模式使用。

# hotkey.recordingButton
source: Press a key…
zh_hans: 按下按键…

# hotkey.reset
source: Reset
zh_hans: 重置

# menu.about
source: About halfFull
zh_hans: 关于 halfFull

# menu.convert
source: Convert (%@)
zh_hans: 转换（%@）

# menu.defaultDirection
source: Default direction
zh_hans: 默认方向

# menu.forceFullWidth
source: Force half → full-width
zh_hans: 强制：半角 → 全角

# menu.forceHalfWidth
source: Force full → half-width
zh_hans: 强制：全角 → 半角

# menu.preferences
source: Preferences…
zh_hans: 偏好设置…

# menu.quit
source: Quit
zh_hans: 退出

# menu.scope
source: Scope
zh_hans: 转换范围

# notify.noChangeBody
source: Text already matches the target form.
zh_hans: 文本已经是目标形态了。

# notify.noChangeTitle
source: Nothing changed
zh_hans: 无需转换

# notify.nothingBody
source: Make sure a text field is focused.
zh_hans: 请确保已聚焦在文本框上。

# notify.nothingTitle
source: Nothing to convert
zh_hans: 没有可转换的内容

# notify.permissionBody
source: Grant access in System Settings → Privacy & Security → Accessibility.
zh_hans: 请在「系统设置 → 隐私与安全 → 辅助功能」中授权。

# notify.permissionTitle
source: Accessibility permission required
zh_hans: 需要辅助功能权限

# onboarding.finish
source: Done
zh_hans: 完成

# onboarding.hotkey.detail
source: Press the shortcut below in any text field. You can change it later in Preferences.
zh_hans: 在任意输入框中按下以下快捷键即可触发转换；之后可在偏好设置中修改。

# onboarding.hotkey.title
source: Your global hotkey
zh_hans: 全局快捷键

# onboarding.openSettings
source: Open System Settings
zh_hans: 打开系统设置

# onboarding.permission.granted
source: Permission granted — you're all set.
zh_hans: 已授权，可以开始使用。

# onboarding.permission.needed
source: Required to simulate ⌘A / ⌘C / ⌘V in other apps.
zh_hans: 需要权限以在其他 App 中模拟 ⌘A / ⌘C / ⌘V。

# onboarding.permission.title
source: Accessibility access
zh_hans: 辅助功能权限

# onboarding.subtitle
source: Convert text in any app to full-width (or back) with one keystroke.
zh_hans: 在任意 App 中按一次快捷键，即可把文本切换为全角（或还原）。

# onboarding.welcome
source: Welcome to %@
zh_hans: 欢迎使用 %@

# prefs.convertSpace
source: Convert space to ideographic (U+3000)
zh_hans: 把空格也转换为全角空格（U+3000）

# prefs.direction
source: Default direction
zh_hans: 默认方向

# prefs.hotkey.intro
source: Press the keys you want to bind. Must include ⌘, ⌃, or ⌥.
zh_hans: 按下需要绑定的按键组合，必须包含 ⌘、⌃ 或 ⌥。

# prefs.hotkey.note
source: The hotkey works system-wide while halfFull is running.
zh_hans: 只要 halfFull 在运行，快捷键就会全局生效。

# prefs.launchAtLogin
source: Launch at login
zh_hans: 开机自动启动

# prefs.notifications
source: Show notifications
zh_hans: 显示通知

# prefs.playSound
source: Play sound on success
zh_hans: 转换成功时播放提示音

# prefs.restoreClipboard
source: Restore clipboard after conversion
zh_hans: 转换后恢复剪贴板内容

# prefs.scope
source: Scope
zh_hans: 转换范围

# prefs.section.behavior
source: Behavior
zh_hans: 行为

# prefs.section.conversion
source: Conversion
zh_hans: 转换设置

# prefs.showMenuBarIcon
source: Show in menu bar
zh_hans: 在菜单栏显示

# prefs.tab.about
source: About
zh_hans: 关于

# prefs.tab.general
source: General
zh_hans: 通用

# prefs.tab.hotkey
source: Hotkey
zh_hans: 快捷键

# hero.tagline
source: Transform focused text or clean the clipboard.
zh_hans: 转换聚焦文本，或清理剪贴板。

# menu.cleanClipboard
source: Clean Clipboard (%@)
zh_hans: 清理剪贴板（%@）

# plainClip.collapseSpaces
source: Collapse consecutive spaces
zh_hans: 合并连续空格

# plainClip.convertToASCII
source: Convert supported characters to ASCII (preserve others)
zh_hans: 将可转写字符转为 ASCII（保留其他文字）

# plainClip.intro
source: Always removes rich formatting. Optional cleanup runs in the order shown.
zh_hans: 始终移除富文本格式；可选清理按以下顺序执行。

# plainClip.normalizeUnicode
source: Normalize Unicode (NFC)
zh_hans: 规范化 Unicode（NFC）

# plainClip.notify.changed.body
source: Newer clipboard content was left untouched.
zh_hans: 新的剪贴板内容已原样保留。

# plainClip.notify.changed.title
source: Clipboard changed
zh_hans: 剪贴板已变化

# plainClip.notify.noText.body
source: Copy some text, then try again.
zh_hans: 请先复制一些文本，然后重试。

# plainClip.notify.noText.title
source: No text on the clipboard
zh_hans: 剪贴板中没有文本

# plainClip.notify.pastePermission.body
source: Allow input control to paste automatically.
zh_hans: 请允许输入控制，以便自动粘贴。

# plainClip.notify.pastePermission.title
source: Clipboard cleaned
zh_hans: 剪贴板已清理

# plainClip.notify.writeFailed.body
source: The pasteboard rejected the cleaned text.
zh_hans: 系统剪贴板拒绝写入清理后的文本。

# plainClip.notify.writeFailed.title
source: Couldn't clean the clipboard
zh_hans: 无法清理剪贴板

# plainClip.pasteAfterCleaning
source: Paste automatically after cleaning
zh_hans: 清理后自动粘贴

# plainClip.pastePermissionHint
source: macOS may request permission the first time automatic paste is used.
zh_hans: 首次使用自动粘贴时，macOS 可能会请求权限。

# plainClip.removeBlankLines
source: Remove blank lines
zh_hans: 移除空白行

# plainClip.removeInvisibleCharacters
source: Remove invisible control characters
zh_hans: 移除不可见控制字符

# plainClip.removeLineBreaks
source: Remove line breaks
zh_hans: 移除换行符

# plainClip.replaceTabs
source: Replace tabs with spaces
zh_hans: 用空格替换制表符

# plainClip.straightenQuotes
source: Replace smart quotes with straight quotes
zh_hans: 把弯引号替换为直引号

# plainClip.trimLeadingLineWhitespace
source: Remove leading spaces and tabs from lines
zh_hans: 移除每行开头的空格和制表符

# plainClip.trimTrailingLineWhitespace
source: Remove trailing spaces and tabs from lines
zh_hans: 移除每行末尾的空格和制表符

# plainClip.trimWholeString
source: Trim surrounding whitespace
zh_hans: 移除文本两端空白

# section.appSettings
source: App Settings
zh_hans: 应用设置

# section.about
source: About
zh_hans: 关于

# section.clipboardSettings
source: Clipboard Settings
zh_hans: 剪贴板设置

# section.focusedTextSettings
source: Focused Text Settings
zh_hans: 聚焦文本设置

# section.hotkey
source: Hotkey
zh_hans: 快捷键

# section.target
source: Target
zh_hans: 目标模式

# target.clipboard
source: Clipboard
zh_hans: 剪贴板

# target.focusedText
source: Focused Text
zh_hans: 聚焦文本

# scope.all
source: Everything
zh_hans: 全部字符

# scope.alphanumeric
source: Letters & digits only
zh_hans: 仅字母与数字

# scope.punctuation
source: Punctuation only
zh_hans: 仅标点符号

# statusbar.tooltip
source: halfFull — transform text and clean the clipboard
zh_hans: halfFull — 转换文本并清理剪贴板

# window.about
source: About
zh_hans: 关于

# window.preferences
source: Preferences
zh_hans: 偏好设置

# window.welcome
source: Welcome
zh_hans: 欢迎
